Catalogs/ЛБ_ШаблоныПриказовВставки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ЛБ_ШаблоныПриказовВставки</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДопИнформацияВставки</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Вставки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Вставка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЛБ_ДрагоценныеКамни</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФормаОгранки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЛБ_ФормыОгранки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидОгранки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЛБ_ВидыОгранки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КачествоОгранки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЛБ_КачествоОгранки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВесоваяГруппа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЛБ_ВесовыеГруппыДрагоценныхКамней</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ЛБ_ШаблоныПриказовВставки/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда  
		Объект.Дата = ТекущаяДата();
		Объект.Ответственный = Пользователи.ТекущийПользователь();
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)	
	ИнформацияВставки = ТекущийОбъект.ДопИнформацияВставки.Получить();
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)	
	ТекущийОбъект.ДопИнформацияВставки = Новый ХранилищеЗначения(ИнформацияВставки);
КонецПроцедуры


&НаКлиенте
Процедура ПослеВыбораВставки(Результат, ДопПараметры) Экспорт
    Если Результат = Неопределено Тогда
        Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Вставка", Результат);
	ОбработкаВыбора = Новый ОписаниеОповещения("ПослеВыбораХарактеристикВставки",ЭтаФорма);
    ОткрытьФорму("ОбщаяФорма.ЛБ_ФормаВыбораХарактеристикВставки", ПараметрыФормы, ЭтаФорма,,,,ОбработкаВыбора,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

&НаСервере
Процедура ПослеВыбораХарактеристикВставки(Результат, ДопПараметры) Экспорт
	 Если Результат = Неопределено Тогда
	    Возврат;
	КонецЕсли;  
	
	ТаблицаРеквизиты = Новый ТаблицаЗначений;
	ТаблицаРеквизиты.Колонки.Добавить("ФормаОгранки");  
	ТаблицаРеквизиты.Колонки.Добавить("ВидОгранки");
	ТаблицаРеквизиты.Колонки.Добавить("КачествоОгранки");  
	
	Если Результат.СписокФО.Количество() = 0 Тогда 
		Если Результат.СписокКО.Количество() = 0 Тогда 
			Для каждого Эл Из Результат.СписокВО Цикл 
				Стр = ТаблицаРеквизиты.Добавить();
				Стр.ВидОгранки = Эл.Значение; 
			Конеццикла; 
		Иначе    
			Для каждого Эл Из Результат.СписокКО Цикл  
				Если Результат.СписокВО.Количество() = 0 Тогда
					Стр = ТаблицаРеквизиты.Добавить();
				    Стр.КачествоОгранки = Эл.Значение; 
				Иначе	       
					Для каждого Эл1 Из Результат.СписокВО Цикл
					    Стр = ТаблицаРеквизиты.Добавить();
						Стр.КачествоОгранки = Эл.Значение;
						Стр.ВидОгранки = Эл1.Значение;
					Конеццикла;	
				КонецЕсли; 
			КонецЦикла;	
		КонецЕсли;	
	Иначе	
		Для каждого Эл Из Результат.СписокФО Цикл 
			СписокВидовОгранки = ЛБ_УправлениеЛомбардом.ПолучитьСписокВыбораВидовОгранки(Результат.Вставка, Эл.Значение); 
			Если Результат.СписокВО.Количество() = 0 И Результат.СписокКО.Количество() = 0 Тогда 
				Стр = ТаблицаРеквизиты.Добавить();
				Стр.ФормаОгранки = Эл.Значение;
            Иначе
				Если Результат.СписокКО.Количество() = 0 Тогда 
					Для каждого Эл1 Из Результат.СписокВО Цикл 
						Стр = ТаблицаРеквизиты.Добавить();
						Стр.ФормаОгранки = Эл.Значение;
						Если НЕ СписокВидовОгранки.НайтиПоЗначению(Эл1.Значение) = неопределено Тогда 
							Стр.ВидОгранки = Эл.Значение;
						КонецЕсли;	
					Конеццикла; 
				Иначе	
					Для каждого Эл1 Из Результат.СписокКО Цикл  
						Если Результат.СписокВО.Количество() = 0 Тогда
							Стр = ТаблицаРеквизиты.Добавить(); 
							Стр.ФормаОгранки = Эл.Значение;
						    Стр.КачествоОгранки = Эл1.Значение; 
						Иначе	       
							Для каждого Эл2 Из Результат.СписокВО Цикл
							    Стр = ТаблицаРеквизиты.Добавить();
								Стр.ФормаОгранки = Эл.Значение;
								Стр.КачествоОгранки = Эл1.Значение;  
								Если НЕ СписокВидовОгранки.НайтиПоЗначению(Эл2.Значение) = неопределено Тогда 
								    Стр.ВидОгранки = Эл2.Значение;
								КонецЕсли;	
							Конеццикла;	
						КонецЕсли; 
					КонецЦикла;	
				КонецЕсли;
			конецЕсли;	
		Конеццикла;   
	КонецЕсли;	

		
	//Запрос  = Новый Запрос;
	//Запрос.УстановитьПараметр("Владелец", Результат.Вставка);
	//Запрос.Текст = "ВЫБРАТЬ
	//               |	ЛБ_ФормыОгранки.Ссылка КАК ФормаОгранки
	//               |ИЗ
	//               |	Справочник.ЛБ_ФормыОгранки КАК ЛБ_ФормыОгранки
	//               |ГДЕ
	//               |	ЛБ_ФормыОгранки.Владелец = &Владелец
	//               |	И ЛБ_ФормыОгранки.ПометкаУдаления = ЛОЖЬ";
	//ТаблицаФО = Запрос.Выполнить().Выгрузить();
	//
	//Запрос.Текст = "ВЫБРАТЬ
	//               |	ЛБ_КачествоОгранки.Ссылка КАК КачествоОгранки
	//               |ИЗ
	//               |	Справочник.ЛБ_КачествоОгранки КАК ЛБ_КачествоОгранки
	//               |ГДЕ
	//               |	ЛБ_КачествоОгранки.Владелец = &Владелец
	//               |	И ЛБ_КачествоОгранки.ПометкаУдаления = ЛОЖЬ";
	//ТаблицаКачество = Запрос.Выполнить().Выгрузить();
	//
	//Если НЕ ТаблицаФО.Количество() = 0 Тогда
	//	Для каждого стр Из ТаблицаФО Цикл
	//		СписокВО = ЛБ_УправлениеЛомбардом.ПолучитьСписокВыбораВидовОгранки(Результат, Стр.ФормаОгранки); 
	//		Для каждого Эл из списокВО Цикл 
	//			Если НЕ ТаблицаКачество.Количество() = 0 Тогда
	//				Для каждого стр1 Из ТаблицаКачество Цикл
	//					НоваяСтр = ТаблицаРеквизиты.Добавить();
	//				    НоваяСтр.ФормаОгранки = Стр.ФормаОгранки; 
	//					НоваяСтр.ВидОгранки = Эл.Значение;
	//					НоваяСтр.КачествоОгранки = Стр1.КачествоОгранки;
	//				КонецЦикла;
	//			Иначе
	//				НоваяСтр = ТаблицаРеквизиты.Добавить();
	//				НоваяСтр.ФормаОгранки = Стр.ФормаОгранки; 
	//				НоваяСтр.ВидОгранки = Эл.Значение;
	//				НоваяСтр.КачествоОгранки = Справочники.ЛБ_КачествоОгранки.ПустаяСсылка();
	//			КонецЕсли;
	//		Конеццикла;	
	//	КонецЦикла;
	//ИначеЕсли НЕ ТаблицаКачество.Количество() = 0 Тогда
	//	Для каждого стр Из ТаблицаКачество Цикл
	//		НоваяСтр = ТаблицаРеквизиты.Добавить();
	//	    НоваяСтр.ФормаОгранки = Справочники.ЛБ_ФормаОгранки.ПустаяСсылка();
	//		НоваяСтр.ВидОгранки = Справочники.ЛБ_ВидыОгранки.ПустаяСсылка();
	//		НоваяСтр.КачествоОгранки = Стр.КачествоОгранки;
	//	КонецЦикла;
	//КонецЕсли;	
	//                  
	
	Запрос  = Новый Запрос;
	Запрос.УстановитьПараметр("Владелец", Результат.Вставка);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ВесовыеГруппыДрагоценныхКамней.Ссылка КАК ВесоваяГруппа
	               |ИЗ
	               |	Справочник.ЛБ_ВесовыеГруппыДрагоценныхКамней КАК ЛБ_ВесовыеГруппыДрагоценныхКамней
	               |ГДЕ
	               |	ЛБ_ВесовыеГруппыДрагоценныхКамней.ВидДрагоценногоКамня = &Владелец
	               |	И ЛБ_ВесовыеГруппыДрагоценныхКамней.ПометкаУдаления = ЛОЖЬ";
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Если НЕ ТаблицаРеквизиты.Количество() = 0 Тогда
			Для каждого стр Из ТаблицаРеквизиты Цикл
				НоваяСтр = Объект.Вставки.Добавить();
				НоваяСтр.Вставка = Результат.Вставка;
				НоваяСтр.ФормаОгранки = Стр.ФормаОгранки;
				НоваяСтр.ВидОгранки = Стр.ВидОгранки;
				НоваяСтр.КачествоОгранки = Стр.КачествоОгранки;
				НоваяСтр.ВесоваяГруппа = Выборка.ВесоваяГруппа;
			КонецЦикла;
		Иначе	
		    НоваяСтр = Объект.Вставки.Добавить();
			НоваяСтр.Вставка = Результат.Вставка;
			НоваяСтр.ВесоваяГруппа = Выборка.ВесоваяГруппа;
		КонецЕсли;	
	КонецЦикла;	        
	Объект.Вставки.Сортировать("Вставка, ФормаОгранки, ВидОгранки, КачествоОгранки, ВесоваяГруппа");

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоВставке(Команда)
	ОбработкаВыбора = Новый ОписаниеОповещения("ПослеВыбораВставки",ЭтаФорма);
    ОткрытьФорму("Справочник.ЛБ_ДрагоценныеКамни.ФормаВыбора",,ЭтаФорма,,,,ОбработкаВыбора,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаСервере
Процедура ПослеВыбораВставкиОчистить(Результат, ДопПараметры) Экспорт
    Если Результат = Неопределено Тогда
        Возврат;
	КонецЕсли;
	
	Отбор = Новый Структура;
	Отбор.Вставить("Вставка", Результат);
	СтрокиВ = Объект.Вставки.НайтиСтроки(Отбор);
	
	Для каждого СтрВ из СтрокиВ Цикл
		Объект.Вставки.Удалить(СтрВ);
	Конеццикла;	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьПоВставке(Команда)
	ОбработкаВыбора = Новый ОписаниеОповещения("ПослеВыбораВставкиОчистить",ЭтаФорма);
    ОткрытьФорму("Справочник.ЛБ_ДрагоценныеКамни.ФормаВыбора",,ЭтаФорма,,,,ОбработкаВыбора,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаСервере
Процедура ПослеВыбораФормыОгранкиОчистить(Результат, ДопПараметры) Экспорт
    Если Результат = Неопределено Тогда
        Возврат;
	КонецЕсли;
	
	Отбор = Новый Структура;
	Отбор.Вставить("ФормаОгранки", Результат);
	СтрокиВ = Объект.Вставки.НайтиСтроки(Отбор);
	
	Для каждого СтрВ из СтрокиВ Цикл
		Объект.Вставки.Удалить(СтрВ);
	Конеццикла;	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьПоФормеОгранки(Команда)
	ОбработкаВыбора = Новый ОписаниеОповещения("ПослеВыбораФормыОгранкиОчистить",ЭтаФорма);
    ОткрытьФорму("Справочник.ЛБ_ФормыОгранки.ФормаВыбора",,ЭтаФорма,,,,ОбработкаВыбора,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаСервере
Процедура ПослеВыбораКачестваОгранкиОчистить(Результат, ДопПараметры) Экспорт
    Если Результат = Неопределено Тогда
        Возврат;
	КонецЕсли;
	
	Отбор = Новый Структура;
	Отбор.Вставить("КачествоОгранки", Результат);
	СтрокиВ = Объект.Вставки.НайтиСтроки(Отбор);
	
	Для каждого СтрВ из СтрокиВ Цикл
		Объект.Вставки.Удалить(СтрВ);
	Конеццикла;	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьПоКачествуОгранки(Команда)
	ОбработкаВыбора = Новый ОписаниеОповещения("ПослеВыбораКачестваОгранкиОчистить",ЭтаФорма);
    ОткрытьФорму("Справочник.ЛБ_КачествоОгранки.ФормаВыбора",,ЭтаФорма,,,,ОбработкаВыбора,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаСервере
Процедура ПослеВыбораВесовойГруппыОчистить(Результат, ДопПараметры) Экспорт
    Если Результат = Неопределено Тогда
        Возврат;
	КонецЕсли;
	
	Отбор = Новый Структура;
	Отбор.Вставить("ВесоваяГруппа", Результат);
	СтрокиВ = Объект.Вставки.НайтиСтроки(Отбор);
	
	Для каждого СтрВ из СтрокиВ Цикл
		Объект.Вставки.Удалить(СтрВ);
	Конеццикла;	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьПоВесовойГруппе(Команда)
	ОбработкаВыбора = Новый ОписаниеОповещения("ПослеВыбораВесовойГруппыОчистить",ЭтаФорма);
    ОткрытьФорму("Справочник.ЛБ_ВесовыеГруппыДрагоценныхКамней.ФормаВыбора",,ЭтаФорма,,,,ОбработкаВыбора,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаСервере
Функция ПолучитьСписокВыбораВидовОгранки(Идентификатор)
	Стр = Объект.Вставки.НайтиПоИдентификатору(Идентификатор); 
	Возврат ЛБ_УправлениеЛомбардом.ПолучитьСписокВыбораВидовОгранки(Стр.Вставка, Стр.ФормаОгранки);
КонецФункции

&НаКлиенте
Процедура ВставкиВидОгранкиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = ложь;
	ТекСтрока = Элементы.Вставки.ТекущиеДанные;
	СписокВ = ПолучитьСписокВыбораВидовОгранки(ТекСтрока.ПолучитьИдентификатор());
    ВыбЗначение = ВыбратьИзСписка(СписокВ, Элемент);
	Если НЕ ВыбЗначение = неопределено Тогда  
		ТекСтрока.ВидОгранки = ВыбЗначение.Значение;
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ПослеВыбораВидаОгранкиОчистить(Результат, ДопПараметры) Экспорт
    Если Результат = Неопределено Тогда
        Возврат;
	КонецЕсли;
	
	Отбор = Новый Структура;
	Отбор.Вставить("ВидОгранки", Результат);
	СтрокиВ = Объект.Вставки.НайтиСтроки(Отбор);
	
	Для каждого СтрВ из СтрокиВ Цикл
		Объект.Вставки.Удалить(СтрВ);
	Конеццикла;	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьПоВидуОгранки(Команда)
	ОбработкаВыбора = Новый ОписаниеОповещения("ПослеВыборавидаОгранкиОчистить",ЭтаФорма);
    ОткрытьФорму("Справочник.ЛБ_ВидыОгранки.ФормаВыбора",,ЭтаФорма,,,,ОбработкаВыбора,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры
